partitioned-pipe-multiscale/fluid3d-left/system/probes
#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (0 0 0)
    (0 0 20)

);

// ************************************************************************* //
